for i in range(20):
    print(i)

# for ეს არის ციკლის Key-word 
# i არის საინტერაციო ცვლადი (ინტერაცია ნიშნავს განმეორებას)
# in არის ში ხოლო in range არის დიაპაზონში
# range(20) ნიშნავს რომ შეიქმნება მათემატიკური მიმდევრობა რომლის სიგრძეც არის 20
# range არის მეთოდი რომელსაც არგუმენტად გადაეცა მნიშვნელობა 20

i = 0
while i < 41:
    print(i)
    i += 1

# i = 0 ეს არის საინტერაციო ცვლადის დეკლარაცია
# while (სანამ) ციკლის შექმნისთვის საჭირო key-word
# ციკლი იმუშავებს მანამდე სანამ i ნაკლებია 41-ზე
# თითოეულ დატრიალებაზე დაიპრინტება ჩვენი 
    # საინტერაციო ცვლადი რომელიც მნიშვნელობას იზრდის ერთით
# i += 1 ეს არის საინტერაციო ცვლადის ინკრემენტაცია (გაზრდა)